tutorials/waterCollum/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


regions
(
    boxToCell
    {
        box (-0.007 0 0) (-0.004 0.006 0.0001);
        fieldValues
        (
            volScalarFieldValue p   2.35438e5
            volVectorFieldValue U.1 (225.86 0 0)
            volVectorFieldValue U.2 (225.86 0 0)
            volScalarFieldValue T.1 381.85
            volScalarFieldValue T.2 381.85
        );
    }
);


// ************************************************************************* //
